; domain
;; Warehouse: a forklift moves pallets between bays and manages its own charge.
;;
;; The charge is symbolic, not numeric: the levels are objects, and (next ?above
;; ?below) in the problem file says which level follows which. Driving steps the
;; charge down one level and charging steps it up one, so a forklift at the
;; bottom level has no (next) fact to match and cannot drive at all.

(define (domain warehouse)
  (:requirements :strips :typing)

  (:types forklift pallet bay level - object)

  (:predicates
    (at ?f - forklift ?b - bay)          ; where the forklift is
    (pallet-at ?p - pallet ?b - bay)     ; where a pallet is resting
    (carrying ?f - forklift ?p - pallet) ; forklift is holding this pallet
    (free ?f - forklift)                 ; forks are empty
    (connected ?from - bay ?to - bay)    ; an aisle, in this direction
    (charger ?b - bay)                   ; this bay has a charging point
    (charge ?f - forklift ?l - level)    ; current charge level
    (next ?above - level ?below - level)); ?below is one step under ?above

  (:action drive
    :parameters (?f - forklift ?from - bay ?to - bay ?l1 - level ?l2 - level)
    :precondition (and (at ?f ?from)
                       (connected ?from ?to)
                       (charge ?f ?l1)
                       (next ?l1 ?l2))
    :effect (and (not (at ?f ?from))
                 (at ?f ?to)
                 (not (charge ?f ?l1))
                 (charge ?f ?l2)))

  (:action pick-up
    :parameters (?f - forklift ?p - pallet ?b - bay)
    :precondition (and (at ?f ?b) (pallet-at ?p ?b) (free ?f))
    :effect (and (not (pallet-at ?p ?b))
                 (carrying ?f ?p)
                 (not (free ?f))))

  (:action put-down
    :parameters (?f - forklift ?p - pallet ?b - bay)
    :precondition (and (at ?f ?b) (carrying ?f ?p))
    :effect (and (pallet-at ?p ?b)
                 (not (carrying ?f ?p))
                 (free ?f)))

  (:action recharge
    :parameters (?f - forklift ?b - bay ?l1 - level ?l2 - level)
    :precondition (and (at ?f ?b) (charger ?b) (charge ?f ?l1) (next ?l2 ?l1))
    :effect (and (not (charge ?f ?l1))
                 (charge ?f ?l2))))

; problem
;; The two-pallet check. One forklift, two pallets in the same bay, both wanted
;; in another. A correct domain ferries them one at a time. A domain whose
;; pick-up forgets (not (free ?f)), or whose put-down forgets to stop carrying,
;; picks both up at once and returns a plan that is two actions short.

(define (problem warehouse-two-pallets)
  (:domain warehouse)

  (:objects
    fork1            - forklift
    pal1 pal2        - pallet
    goods-in dock    - bay
    full half low    - level)

  (:init
    (next full half) (next half low)
    (charge fork1 full)
    (at fork1 goods-in)
    (free fork1)
    (charger goods-in)
    (charger dock)
    (connected goods-in dock) (connected dock goods-in)
    (pallet-at pal1 goods-in)
    (pallet-at pal2 goods-in))

  (:goal (and (pallet-at pal1 dock) (pallet-at pal2 dock))))

; plan
1. (pick-up fork1 pal1 goods-in)
   deleted: (pallet-at pal1 goods-in) (free fork1)
   added: (carrying fork1 pal1)
   goals met: 0 of 2
2. (drive fork1 goods-in dock full half)
   deleted: (at fork1 goods-in) (charge fork1 full)
   added: (at fork1 dock) (charge fork1 half)
   goals met: 0 of 2
3. (put-down fork1 pal1 dock)
   deleted: (carrying fork1 pal1)
   added: (pallet-at pal1 dock) (free fork1)
   goals met: 1 of 2
4. (drive fork1 dock goods-in half low)
   deleted: (at fork1 dock) (charge fork1 half)
   added: (at fork1 goods-in) (charge fork1 low)
   goals met: 1 of 2
5. (recharge fork1 goods-in low half)
   deleted: (charge fork1 low)
   added: (charge fork1 half)
   goals met: 1 of 2
6. (pick-up fork1 pal2 goods-in)
   deleted: (pallet-at pal2 goods-in) (free fork1)
   added: (carrying fork1 pal2)
   goals met: 1 of 2
7. (drive fork1 goods-in dock half low)
   deleted: (at fork1 goods-in) (charge fork1 half)
   added: (at fork1 dock) (charge fork1 low)
   goals met: 1 of 2
8. (put-down fork1 pal2 dock)
   deleted: (carrying fork1 pal2)
   added: (pallet-at pal2 dock) (free fork1)
   goals met: 2 of 2
